---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceRule2Suspension
source: html/b986fc3a-8712-548f-0273-6de59ded649b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceRule2Suspension Property

"Is grid 2 suspended?"

## Syntax (C#)
```csharp
public static ForgeTypeId DividedSurfaceRule2Suspension { get; }
```